# Brewfile
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "teamookla/speedtest"

# The usual stuff
brew "coreutils"
brew "ffmpeg"
brew "grip"
brew "openconnect"
brew "speedtest"
brew "python@3.10"
brew "go"
brew "rust"
brew "tty-clock"
brew "stow"
brew "starship"
brew "llvm"
brew "svn"
brew "git"
brew "vim"
brew "fzf"
brew "ripgrep"
brew "tree"
brew "mpv"
brew "clang-format"
brew "hugo"
brew "wget"
brew "gh"
brew "watch"
brew "ghc"
brew "cabal-install"
brew "haskell-stack"
brew "haskell-language-server"
brew "cmake"
brew "jq"
brew "imagemagick"
brew "scc"
brew "tokei"
brew "rust"

# Casks
cask "alfred"
cask "firefox"
cask "karabiner-elements"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
cask "monitorcontrol"
cask "vlc"
cask "font-fira-code-nerd-font"
cask "basictex"
cask "obs"
cask "parallels"
cask "docker"
cask "qbittorrent"
cask "microsoft-teams"
cask "teamviewer"

# Personal
brew "pfetch"
cask "minecraft"
cask "eagle"
brew "yt-dlp"
cask "chatterino"
cask "via"
cask "vial"
cask "discord"
cask "bitwarden"
cask "mullvadvpn"
