# Brewfile
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "teamookla/speedtest"

# The usual stuff
brew "coreutils"
brew "ffmpeg"
brew "grip"
brew "openconnect" #  anyconnect alternative for school vpn
brew "speedtest"
brew "python@3.9"
brew "python@3.10"
brew "tty-clock"
brew "pfetch" # omg just stop
brew "stow"
brew "tmux"
brew "youtube-dl"
brew "starship"
brew "llvm"
brew "svn"
brew "git"
brew "vim"
brew "fzf"
brew "ripgrep"
brew "tree"
brew "mpv"
brew "clang-format"
brew "hugo"
brew "wget"
brew "gh"

# Casks
cask "alfred"
cask "discord"
cask "firefox"
cask "karabiner-elements"
cask "spotify"
cask "visual-studio-code"
cask "zoom"
cask "monitorcontrol"
cask "vlc"
cask "font-fira-code-nerd-font"
cask "basictex"
cask "obs"
cask "teamviewer"
