# Brewfile — `brew bundle --file=apple/Brewfile`

# ─── Shell & modern CLI ──────────────────────────────────────────────
brew "stow"           # dotfile symlink manager
brew "starship"       # prompt
brew "tmux"
brew "fzf"            # fuzzy finder (Ctrl-R / Ctrl-T)
brew "ripgrep"        # rg — fast grep
brew "fd"             # friendlier find
brew "bat"            # cat with syntax highlighting
brew "eza"            # modern ls with git/icons
brew "zoxide"         # smarter cd (z)
brew "tree"
brew "jq"             # JSON wrangling
brew "wget"
brew "watch"
brew "coreutils"
brew "fastfetch"     # system info (pfetch was removed from Homebrew)
brew "mole"          # reclaims disk space

# ─── Languages & build ───────────────────────────────────────────────
brew "python@3.13"
brew "node"
brew "go"
brew "rust"
brew "ghc"
brew "llvm"
brew "clang-format"
brew "cmake"
brew "git"
brew "gh"             # GitHub CLI
brew "svn"
brew "vim"

# ─── Code stats ──────────────────────────────────────────────────────
brew "scc"
brew "tokei"
brew "cloc"

# ─── Media & misc ────────────────────────────────────────────────────
brew "ffmpeg"
brew "mpv"
brew "yt-dlp"
brew "grip"           # GitHub-flavored markdown preview
brew "hugo"           # static site generator
brew "tty-clock"

# ─── Casks: applications ─────────────────────────────────────────────
cask "ghostty"
cask "visual-studio-code"
cask "firefox"
cask "spotify"
#cask "vlc"
#cask "obs"
cask "docker-desktop"
cask "zoom"
cask "ghidra"
cask "claude"
cask "claude-code"
#cask "cursor"
#cask "chatgpt"
#cask "slack"
#cask "qflipper"        # Flipper Zero companion
#cask "parallels"
#cask "microsoft-teams"
#cask "alfred"
#cask "teamviewer"
#cask "pomotroid"
#cask "qbittorrent"
#cask "kicad"     -- massive, takes a while to download/install

# ─── Casks: fonts ────────────────────────────────────────────────────
cask "font-fira-code-nerd-font"

# ─── TeX (pick one) ──────────────────────────────────────────────────
#cask "basictex"  -- lighter installation but less compatibility
#cask "mactex"    -- massive, will take a while to download/install

# ─── Personal — do NOT install on a work machine ─────────────────────
cask "discord"
cask "chatterino"
cask "mullvad-vpn"
cask "vial"           # keyboard firmware config
#cask "minecraft"
#cask "league-of-legends"
#cask "via"
#cask "eagle"
